[
    {
        "title" : "flashcard",
        "lien" : "flashcard",
        "compétence" : [
            1
        ],
        "image" : {
            "lien" : "https://repository-images.githubusercontent.com/458857316/4633fa6d-813b-4a8b-ba52-a462b128d7ae",
            "alt" : "illustration flashcard",
            "title" : "illustration flashcard"
        },
        "contributeur" : [
            "Mattéo Kervadec"
        ],
        "date" : "début 2024"
    },
    {
        "title" : "flashcard",
        "depot" : "https://github.com/Matteo-K/flashCard",
        "content" : [
            {
                "article" : "art_presentation_project",
                "section" : {
                    "image" : {
                        "lien" : "images/Illustration_project/question-flashcard.png",
                        "alt" : "apperçu des flashcard",
                        "title" : "apperçu des flashcard"
                    },
                    "description" : "Un programme qui pose un intitulé comme \"La date de la révolution française\" puis quand l'utilisateur demande, le programme lui donner la réponse ainsi l'utilisateur peut passer à la prochaine intituler.",
                    "langage" : [
                        "python"
                    ],
                    "objectifs" : [
                        "Réalisation d'un petit programme pour m'aider à réviser ma comptabilité.",
                        "Faire un programme simple à comprendre qui pourrait m'aider dans d'autre cours."
                    ],
                    "competence_developpe" : [
                        "Manipulation des fichiers",
                        "Réaliser un .exe depuis un fichier python"
                    ]
                }
            },
            {
                "article" : "art_etape",
                "section" : [
                    {
                        "titre" : "Liste des fonctionnalités",
                        "text" : [
                            "Pour faire des cartes-mémoires qui peuvent s'adapter à chaque apprentissage, il faut plusieurs techniques de mémorisation.",
                            "Ouverture de fichier - L'utilisateur peut entrer le chemin absolu du fichier. Ainsi l'utilisateur peut étudier librement son sujet. Ce qui rend le logiciel dynamique.",
                            "Apprentissage - L'ensemble des cartes s'affiches avec la question et la réponse en face.",
                            "Question-réponse - Une question ou une réponse s'affiche. Et le but est de donner sa réponse ou question. Au bout de 20 questions, le programme donne le score/résultat de l'utilisateur. Mais aussi l'ensemble des questions dont il a eu faux.",
                            "Carte - Les questions/réponses s'affichent une par une appuyant sur entrer pour faire défiler les cartes."
                        ],
                        "lien" : [
                        ] 
                    },
                    {
                        "titre" : "Implémentation",
                        "text" : [
                            "À la base, j'ai voulu réaliser ce logiciel pour m'aider dans mes révisions et pourquoi pas pour d'autres personnes. Donc j'ai décidé de le réalisé en python vu que c'est un langage de programmation que beaucoup connaissent. Sinon je l'aurai réaliser en perl pour continuer d'apprendre ce langage.",
                            "Mais j'ai découvert que nous pouvons rendre des fichiers python exécutable. Donc j'ai décidé de me renseigner et de tester."
                        ],
                        "lien" : [
                        ] 
                    },
                    {
                        "titre" : "Futur fonctionnalité",
                        "text" : [
                            "Pour des futures fonctionnalités, j'aimerais  que l'utilisateur puisse choisir entre 4 propositions. Ces propositions seront prises aléatoirement parmi d'autres questions. Mais parmi ces choix, il y a la bonne réponse.",
                            "Ensuite,l'autre fonctionnalité serait de pouvoir prendre un thème et le déposer dans des tableaux."
                        ],
                        "lien" : [
                        ] 
                    }
                ]
            }
        ]
    } 
]
